/* Задания на урок:

1. Удалить все рекламные блоки сот страницы (правая часть сайта)

2. Измениить жанр фильма, поменять "комедии" на "драма"

3. Изменить задний фон на изображение "img". Оно лежит в папке img

4. Список фильмов на странрице сформировать на основании данных из этого JS файла. Отсортировать по алфавиту

5. Добавить нумерацию вывеленных филььмов

6. Реализовать функционал, что после заполнения формы и нажатия кнопки "Подтвердить" -
новый фильм добавляется в список. Страница не должна перезагружаться.
Новый фильм должен добавляться в movieDB.movies.
Для получения доступа к значению input - обращаемся к нему как input.value;
P.S. Здесь есть несколько вариантов решения задачи, принимается любой, но рабочий.

7. Если название фильма больше, чем 21 символ - обрезать его и добавить три точки

8. При клике на мусорную корзину - элемент будет удаляться из списка (сложно)

9. Если в форме стоит галочка "Сделать любимым" - в консоль вывести сообщение:
"Добавляем любимый фильм"

10. Фильмы должны быть отсортированы по алфавиту */

'use strict';


const movieDB = {
    movies: [
        'Логан',
        'Лига справедливости',
        'Ла-Ла лэнд',
        'Одержимость',
        'Скотт Пилигримм против...',
    ]
}

const adv = document.querySelectorAll('.promo__adv img'),
    poster = document.querySelector('.promo__bg'),
    genre = poster.querySelector('.promo__genre'),
    movieList = document.querySelector('.promo__interactive-list')


adv.forEach(item => {
    item.remove()
})

genre.textContent = 'драма'

poster.style.backgroundImage = 'url("img/bg.jpg")'

movieList.innerHTML = ''

movieDB.movies.sort()
movieDB.movies.forEach((film, i) => {
    movieList.innerHTML += '  <li class="promo__interactive-item">' ${film} ${i + 1} +
        '                            <div class="delete"></div>\n' +
        '                        </li>'
});




